{
  "story": {
    "by": "cdrnsf",
    "descendants": 145,
    "id": 46911901,
    "kids": [
      46912336,
      46912393,
      46912226,
      46912506,
      46913021,
      46912976,
      46912819,
      46912363,
      46912353,
      46913075,
      46912893,
      46912984,
      46912883,
      46912089,
      46912134,
      46912711,
      46912845,
      46912796,
      46912904,
      46912559,
      46912098,
      46912338,
      46912426,
      46912258,
      46912484,
      46912463,
      46912070,
      46912653,
      46912194,
      46912115,
      46912616,
      46912850,
      46912541,
      46912497,
      46912420,
      46912366,
      46912296,
      46912537,
      46912063,
      46912782,
      46912211
    ],
    "score": 267,
    "time": 1770380203,
    "title": "I now assume that all ads on Apple news are scams",
    "type": "story",
    "url": "https://kirkville.com/i-now-assume-that-all-ads-on-apple-news-are-scams/"
  },
  "article_text": "Kirkville - I Now Assume that All Ads on Apple News Are Scams Skip to content In 2024, Apple signed a deal with Taboola to serve ads in its app, notably Apple News. John Gruber, writing in Daring Fireball said at the time: If you told me that the ads in Apple News have been sold by Taboola for the last few years, I’d have said, “Oh, that makes sense.” Because the ads in Apple News — at least the ones I see1 — already look like chumbox Taboola ads. Even worse, they’re incredibly repetitious. I use Apple News to keep up on topics that I don’t find in sources I pay for (The Guardian and The New York Times). But there’s no way I’m going to pay the exorbitant price Apple wants for Apple News+ – £13 – because, while you get more publications, you still get ads. And those ads have gotten worse recently. Many if not most of them look like and probably are scams. Here are a few examples from Apple News today. Here are three ads that are scammy; the first two were clearly generated by AI, and the third may have been created by AI. Why are they scams? When I searched domain information for the domains, I found that they were registered very recently. Domain Name: MUSTYLEVO.COM Registry Domain ID: 3059688301_DOMAIN_COM-VRSN Registrar WHOIS Server: whois.gname.com Registrar URL: http://www.gname.com Updated Date: 2026-02-04T07:23:58Z Creation Date: 2026-01-21T07:23:43Z Domain Name: SOLVERACO.COM Registry Domain ID: 3045027870_DOMAIN_COM-VRSN Registrar WHOIS Server: grs-whois.hichina.com Registrar URL: http://wanwang.aliyun.com Updated Date: 2025-12-05T06:10:51Z Creation Date: 2025-12-05T06:07:40Z Domain Name: SHIYAATELIER.COM Registry Domain ID: 3037972202_DOMAIN_COM-VRSN Registrar WHOIS Server: whois.name.com Registrar URL: http://www.name.com Updated Date: 2025-11-12T06:47:14Z Creation Date: 2025-11-12T06:47:13Z This recent registration doesn’t necessarily mean they are scams, but they don’t inspire much confidence. Here’s one example. This ad from Tidenox, whose website says I am retiring, showing a photo of an elderly woman, who says, “For 26 years, Tidenox has been port of your journey in creating earth and comfort at home.” The image of the retiring owner is probably made by AI. ( Update : someone on Hacker News pointed out the partly masked Google Gemini logo on the bottom right. I hadn’t spotted that, in part because I don’t use any AI image generation tools.) These fake “going out of business ads” have been around for a few years, and even the US Better Business Bureau warns about them , as they take peoples’ money then shut down. Does Apple care? Does Taboola care? Does Apple care that Taboola serves ads like this? My guess: no, no, and no. Note the registration date for the tidenox.com domain. It’s nowhere near 26 years old, and it’s registered in China: Domain Name: TIDENOX.COM Registry Domain ID: 2987356919_DOMAIN_COM-VRSN Registrar WHOIS Server: grs-whois.hichina.com Registrar URL: http://wanwang.aliyun.com Updated Date: 2025-05-29T09:17:31Z Creation Date: 2025-05-29T09:14:35Z Shame on Apple for creating a honeypot for scam ads in what they consider to be a premium news service. This company cannot be trusted with ads in its products any more. Email a link to a friend (Opens in new window) Email Share on Bluesky (Opens in new window) Bluesky Share on Mastodon (Opens in new window) Mastodon Discover more from Kirkville Subscribe to get the latest posts sent to your email. Type your email… Subscribe",
  "comments": [
    {
      "by": "speak_plainly",
      "id": 46912336,
      "kids": [
        46912709,
        46912390,
        46912768,
        46912659
      ],
      "parent": 46911901,
      "text": "Apple News and News+ represent everything wrong with modern Apple: a ham-fisted approach to simplicity that ignores the end user. It is their most mediocre service, jarringly jamming cheap clickbait next to serious journalism in a layout that makes no sense.<p>The technical execution is just as lazy. While some magazines are tailored, many are just flat, low-res PDFs that look terrible on the high-end Retina screens Apple sells. Worst of all, Apple had the leverage to revolutionize a struggling industry; instead, they settled for a half-baked aggregator.<p>It’s a toxic mix of Apple tropes that simply weren&#x27;t thought through. The ads are the cherry on the cake.",
      "time": 1770383051,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "elashri",
      "id": 46912393,
      "kids": [
        46912763,
        46912566,
        46912534,
        46912888,
        46912441,
        46912504
      ],
      "parent": 46911901,
      "text": "We should assume that all ads in general are scams. The noise to signal ratio is too large to care. Word of mouth and maybe trusted communities like HN is the only way to reliably discover new things.",
      "time": 1770383361,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "makingstuffs",
      "id": 46912226,
      "kids": [
        46912368,
        46912319,
        46912373,
        46912302,
        46912485,
        46912322
      ],
      "parent": 46911901,
      "text": "I don’t know if it is just a symptom of growing up during the days of the net’s Wild West and navigating through sites like gamecopyworld or what, but I just seem to have some inbuilt filter which doesn’t even acknowledge the existence of ads.<p>It’s hard to explain but it is like some subconscious filtering that occurs on a preRecognise hook or something. Weird.",
      "time": 1770382446,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "sammyoos",
      "id": 46912506,
      "kids": [
        46912607,
        46912942,
        46912643,
        46912958,
        46912671,
        46912542
      ],
      "parent": 46911901,
      "text": "I bought a remarkably similar mug (last advert shown) from an add from different site [1].  Everything about it was a fake.  Almost every feature they advertised did not exist (including the fact that it did not come in a gift box.)  That was from a site I visit a lot and I wanted to show support.  BTW the AI generated animation is quite cool, too bad it is not real...<p>Do not buy this!!\n[1] <a href=\"https:&#x2F;&#x2F;kenmiso.com&#x2F;products&#x2F;%E2%9A%A1%E2%9C%A8ultimate-v8-engine-gift-mug-a-gearhead%27s-dream\" rel=\"nofollow\">https:&#x2F;&#x2F;kenmiso.com&#x2F;products&#x2F;%E2%9A%A1%E2%9C%A8ultimate-v8-e...</a>",
      "time": 1770384170,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "ataru",
      "id": 46913021,
      "parent": 46911901,
      "text": "I&#x27;ve noticed that the apple news ads target sensitive issues.  The retirement one is a good example of that.  I&#x27;ve seen ads that appear to already know my financial status and health conditions.  I tried the option to reset my advertising identifier, it doesn&#x27;t seem to make much impact.",
      "time": 1770387093,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "benterix",
      "id": 46912976,
      "parent": 46911901,
      "text": "I&#x27;d generalize it to &quot;I assume all ads on major platforms are scam.&quot; This includes especially channels owned by Google and Meta.<p>I remember back in 2010 I had to wait a week and correct my ad before it was approved and now they basically stream all kinds of scams without checking. They do have quite a few people, they <i>could</i> build a better scam detection system but it&#x27;s against their interests.",
      "time": 1770386850,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "victor106",
      "id": 46912819,
      "parent": 46911901,
      "text": "Dear Tim Apple: you don’t need the tiny amount you get these ads. You do need to fix this embarrassing thing that you released called “Liquid Glass”",
      "time": 1770385908,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "4ggr0",
      "id": 46912363,
      "parent": 46911901,
      "text": "I  Assume That All Ads    Are Scams",
      "time": 1770383187,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "pupppet",
      "id": 46912353,
      "parent": 46911901,
      "text": "Like a cancer, a publicly traded company must grow at any cost.",
      "time": 1770383144,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "colesantiago",
      "id": 46913075,
      "parent": 46911901,
      "text": "You should assume all ads are complete scams.<p>Some of them funded by scamming others, crypto, VC, etc. Even the first link in the article [0] has a VC backed startup advertising (they paid $11K!) that nobody asked for.<p>There is no such thing as an ethical ad whatsoever.<p>[0] <a href=\"https:&#x2F;&#x2F;daringfireball.net&#x2F;2024&#x2F;07&#x2F;apple_taboola_sitting_in_a_tree\" rel=\"nofollow\">https:&#x2F;&#x2F;daringfireball.net&#x2F;2024&#x2F;07&#x2F;apple_taboola_sitting_in_...</a>",
      "time": 1770387363,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "npiauilino",
      "id": 46912893,
      "parent": 46911901,
      "text": "I do have a similar feeling, but about YouTube ads. Seems like the region where I live there&#x27;s a problem with gambling apps and, even if I&#x27;ve never used any app of this kind or showed interest in gambling sites&#x2F;platforms, I&#x27;m bombarded everyday by ads of gambling apps on YouTube.<p>Since last year, I&#x27;ve been reporting every gambling ad as &quot;Promoting illegal product&#x2F;service&quot; (they are, in fact, illegal here) to no avail, there&#x27;s no end to these ads nor seems like YouTube is willing to do anything but implement dark patterns to discourage reporting, such as delayed pop-ups when reporting to interrupt typing.<p>I noticed some time ago that others ads that seemed not related to gambling were also leading to gambling apps. They are categorized as anything, like Hotels, Banking, Cullinary and Education. Don&#x27;t look like YouTube checks if the things being advertised are really what they claim to be. It&#x27;s worse when you remember that kids also use YouTube a lot.",
      "time": 1770386343,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "meindnoch",
      "id": 46912984,
      "kids": [
        46913048
      ],
      "parent": 46911901,
      "text": "All ads are scams. Some are worse than others.",
      "time": 1770386895,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "flpm",
      "id": 46912883,
      "parent": 46911901,
      "text": "Please condense all spread out comments &quot;all ads are scam&quot; into one single comment thread.<p>ChatGPT: (sponsored) Buy this cute mug in the shape of a purse with AI created pictures of a dog! Just $19.99 (at 80% discount)",
      "time": 1770386296,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "wobfan",
      "id": 46912089,
      "kids": [
        46912181,
        46912261
      ],
      "parent": 46911901,
      "text": "I love how, on the &quot;I am retiring page&quot;, the image of the old woman even has artifacts of the Gemini logo on the bottom right - someone very probably manually tried to blur them with a tool that was not meant for blurring.<p>Somehow, he or she was still convinced and put it up.",
      "time": 1770381615,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "aquir",
      "id": 46912134,
      "kids": [
        46912438,
        46912153,
        46912273
      ],
      "parent": 46911901,
      "text": "It’s a bit like that MSN page what MS is forcing on millions through Edge and W11 widgets",
      "time": 1770381913,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "duxup",
      "id": 46912711,
      "parent": 46911901,
      "text": "Internet add networks really lowered the bar for advertising.<p>Ads on social media, youtube, everywhere seem to be a high % of scams, or weirdly creepy type health products, or creepily manipulative (and ironic) content like &quot;if you&#x27;re not using my 5 strategies then you&#x27;re being manipulated&quot;.<p>What is most odd is that I wouldn&#x27;t mind ads that were for things I want, but nobody seems interested in that angle, they want to just impose their stuff on me.",
      "time": 1770385211,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "storus",
      "id": 46912845,
      "parent": 46911901,
      "text": "I never use Apple News but they often pop up among the apps that are using significant energy. I am wondering what does it really do on the background.",
      "time": 1770386050,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "dev_l1x_be",
      "id": 46912796,
      "parent": 46911901,
      "text": "The financial optimum for any ad company is to accommodate scams.",
      "time": 1770385792,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "jcelerier",
      "id": 46912904,
      "kids": [
        46913042
      ],
      "parent": 46911901,
      "text": "I&#x27;m amazed to discover that there are people on earth that believe that some ads <i>aren&#x27;t</i> scam. It should be forbidden by law to advertise, it is a scourge on humanity.",
      "time": 1770386426,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "frizlab",
      "id": 46912559,
      "parent": 46911901,
      "text": "Personally I assume ALL ads are scams. Never mind where they are from.",
      "time": 1770384436,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "pards",
      "id": 46912098,
      "kids": [
        46912389,
        46912284
      ],
      "parent": 46911901,
      "text": "I assume all social media ads are also scams.",
      "time": 1770381654,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "roosgit",
      "id": 46912338,
      "parent": 46911901,
      "text": "I wasn&#x27;t sure where I&#x27;d seen that &quot;retiring&quot; spiel before, but then I remembered someone was (still is) selling a handmade jewelry website claiming $4.3M revenue and $1.3M profit.",
      "time": 1770383067,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "TimByte",
      "id": 46912426,
      "parent": 46911901,
      "text": "The depressing part is that this is probably working just well enough financially",
      "time": 1770383653,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "insin",
      "id": 46912258,
      "kids": [
        46912428
      ],
      "parent": 46911901,
      "text": "<p><pre><code>    title.replace(&#x2F;(i now assume that |on apple news )&#x2F;ig, &#x27;&#x27;)</code></pre>",
      "time": 1770382642,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "d--b",
      "id": 46912484,
      "parent": 46911901,
      "text": "At this stage pretty much all ads on the internet are scams",
      "time": 1770383996,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "bradley13",
      "id": 46912463,
      "kids": [
        46912530
      ],
      "parent": 46911901,
      "text": "We use a PiHole, plus ad-blocking browsers, so we see very few ads. According to Claude, around 40% of users in the West use ad-blockers at least some of the time.<p>You would think that advertisers would understand that they are killing the goose? They have made ads pervasive, annoying and untrustworthy. Hence, fewer and fewer people are willing to put up with them.<p>Perhaps enshittification will eventually hit a wall. One can hope.",
      "time": 1770383908,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "bearjaws",
      "id": 46912070,
      "kids": [
        46912093,
        46912206
      ],
      "parent": 46911901,
      "text": "Mark my words, Apple is going to go full enshittification in the next 5 years because they&#x27;ve squeezed every last drop out of hardware pricing.<p>Especially with the failed Apple Intelligence that they will now have to pay their way out of.",
      "time": 1770381471,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "LightBug1",
      "id": 46912653,
      "parent": 46911901,
      "text": "Well, most ads are.<p>It&#x27;s the very rare advert that speaks to you, and informs you, and simply makes you aware of its existence without the ridiculous, oversized, plastic cherry on top.",
      "time": 1770384930,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "villgax",
      "id": 46912194,
      "kids": [
        46912524,
        46912213
      ],
      "parent": 46911901,
      "text": "This is true of all news sites, some hearing aid, you wont believe, why your pet does X etc etc",
      "time": 1770382230,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "timpera",
      "id": 46912115,
      "kids": [
        46912232,
        46912598,
        46912148,
        46912272
      ],
      "parent": 46911901,
      "text": "Why would Apple enshittify their News app in this way when there are so many legitimate advertisers out there? It seems obviously damaging to their brand, so it makes no sense to me.",
      "time": 1770381736,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "mrcwinn",
      "id": 46912616,
      "parent": 46911901,
      "text": "I stopped using it about a year ago and I’m so much better for it. It was shocking that Apple would deliver a feed filled with so much tabloid trash and gross ads about plastic surgery and weight loss. It’s really a gross product.",
      "time": 1770384750,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "deafpolygon",
      "id": 46912541,
      "parent": 46911901,
      "text": "All ads are scams.",
      "time": 1770384338,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "dkobia",
      "id": 46912497,
      "parent": 46911901,
      "text": "Surely what they make from these ads is negligible enough to not warrant the terrible user experience for something users pay for. The ads in Apple News are infuriating.",
      "time": 1770384106,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "micromacrofoot",
      "id": 46912420,
      "parent": 46911901,
      "text": "Probably simpler to assume all ads are scams and work back from there",
      "time": 1770383606,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "globular-toast",
      "id": 46912366,
      "parent": 46911901,
      "text": "All ads are scams. They are there to make you unhappy causing you to need to work&#x2F;spend money to become happy again.",
      "time": 1770383195,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "wazoox",
      "id": 46912296,
      "kids": [
        46912560
      ],
      "parent": 46911901,
      "text": "But these are just the same ads as on Google and everywhere else. Almost all internet ads are scam nowadays.",
      "time": 1770382825,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "oriettaxx",
      "id": 46912537,
      "parent": 46911901,
      "text": "what about the #1 result in any research in Apple store<p>100% shit",
      "time": 1770384331,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "zvqcMMV6Zcr",
      "id": 46912063,
      "kids": [
        46912136,
        46912084,
        46912357,
        46912123,
        46912224,
        46912114,
        46912283
      ],
      "parent": 46911901,
      "text": "This is a bit silly. Are there any ads that people do trust?",
      "time": 1770381413,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "deviation",
      "id": 46912211,
      "kids": [
        46912764,
        46912244,
        46912239,
        46912250,
        46912787
      ],
      "parent": 46911901,
      "text": "Nice - Another post shaming Apple for a problem which the entire internet faces.<p>I&#x27;ll load up Facebook right now and get the same things. Google? The same.<p>And to no surprise, ads like these break Apple&#x27;s ad content guidelines[1].<p>OP should figuratively put down the video camera and go perform CPR. Report the Ad. Make the internet a better place.<p>[1]: <a href=\"https:&#x2F;&#x2F;support.apple.com&#x2F;en-au&#x2F;guide&#x2F;adguide&#x2F;apd527d891a8&#x2F;1.0&#x2F;icloud&#x2F;1.0\" rel=\"nofollow\">https:&#x2F;&#x2F;support.apple.com&#x2F;en-au&#x2F;guide&#x2F;adguide&#x2F;apd527d891a8&#x2F;1...</a>",
      "time": 1770382333,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "ksec",
      "id": 46912709,
      "kids": [
        46912916,
        46912982,
        46912846,
        46912889
      ],
      "parent": 46912336,
      "text": "Ever since Apple moved to Services Strategy in 2014 it has been like this. Services were not there so they could provide a better experience for its &quot;<i>customers</i>&quot;. I use the word &quot;<i>customer</i>&quot; here which is what Apple &#x2F; Steve Jobs used to call their loyal fans, and not <i>user</i>. But to further growth their Revenue pie because they foresee iPhone one day will stagnant.<p>You now have Apple Fitness+, Apple TV, News, Music, Arcade. None of these are of any quality of what Apple used to be. It is really sad.<p>Oh and the most iconic thing? Apple was the one who tried to kill internet ads between 2017 - 2020.",
      "time": 1770385207,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "robmccoll",
      "id": 46912390,
      "parent": 46912336,
      "text": "They also bought and killed texture, a fantastic cross-platform magazine subscription service, to somehow further Apple News. I subscribed to Texture on Android. I wouldn&#x27;t give a dollar to Apple News even if I was in the Apple ecosystem.",
      "time": 1770383353,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "nntwozz",
      "id": 46912768,
      "kids": [
        46912927
      ],
      "parent": 46912336,
      "text": "At what point did the old Apple cross the threshold to &quot;modern&quot; Apple?<p>I agree with your point I just find the distinction hard to pinpoint.<p>It&#x27;s like the (incorrect) analogy of the boiled frog, I know it&#x27;s a cliché but I really feel things started downhill in overall quality and wow factor with the advent of Tim Cook.<p>SJ had failures like Ping and MobileMe, but they seemed to pick up on the criticism back then and execute correctly quickly after.<p>Now because of the penny-pinching and success of Apple nobody makes a big deal out of anything, the momentum is so strong that stuff like liquid glass can come through unpolished&#x2F;unfinished&#x2F;unrefined.<p>It seems to me that Apple University failed its mission completely.<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Apple_University\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Apple_University</a>",
      "time": 1770385596,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "JKCalhoun",
      "id": 46912659,
      "kids": [
        46912886,
        46912833
      ],
      "parent": 46912336,
      "text": "I ignore Apple News these days. I had high hopes when Apple bought the company that eventually became their News app. Alas…<p>Of course I hate that I can&#x27;t block ads, but at the same time, I wonder if the <i>unblockable</i> ads are not, in fact, a help for that &quot;struggling industry&quot;.",
      "time": 1770384970,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "WarmWash",
      "id": 46912763,
      "kids": [
        46912985,
        46912902
      ],
      "parent": 46912393,
      "text": "Generally if all the ads you see are scammy, it means you probably are using some form of tracking&#x2F;privacy protection.<p>When an ad network has a strong profile on you, legitimate companies pay good money for those ad slots. When they don&#x27;t really know who you are, only bottom feeders bid on the ad   slots you see.<p>In a way, it almost acts as retribution for not submitting to the anti-privacy machine.",
      "time": 1770385583,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "matheusmoreira",
      "id": 46912566,
      "kids": [
        46912697
      ],
      "parent": 46912393,
      "text": "&gt; We should assume that all ads in general are scams. The noise to signal ratio is too large to care.<p>Completely agree.<p>&gt; Word of mouth and maybe trusted communities like HN is the only way to reliably discover new things.<p>There is no evidence that HN is not being actively astroturfed though. Sadly community filtering cannot replace trust in individuals.",
      "time": 1770384495,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "pjc50",
      "id": 46912534,
      "kids": [
        46913041
      ],
      "parent": 46912393,
      "text": "The only way out of this is to make ad platforms liable for scam ads. At the moment it&#x27;s simply too profitable to print lies.",
      "time": 1770384324,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "Terretta",
      "id": 46912888,
      "parent": 46912393,
      "text": "I can&#x27;t say the AI scripted AI voiced &quot;my wife bet my abs vs. a trip to Paris&quot; and &quot;I ordered this and was going to throw it away but then the heavens opened and angels descended and gave me this Alibaba tchotchke&quot; are harbingers of the idiocracy. Because it&#x27;s already here.<p>&#x2F;&#x2F; Adblock at DNS used to kill these Apple News ads. They&#x27;re no longer suppressed. Free with their Plus all the things and aggregated my content subs but I quit using it. Had loved Texture, this now sucks.",
      "time": 1770386318,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "rgblambda",
      "id": 46912441,
      "parent": 46912393,
      "text": "That, unfortunately has pushed advertisers into guerrilla marketing tactics like posts and comments disguised as genuine user behaviour. It means we now need to parse whether what we&#x27;re looking at is an ad or not.<p>Maybe they would have done that anyway though.",
      "time": 1770383747,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "TimByte",
      "id": 46912504,
      "parent": 46912393,
      "text": "In practice I mostly ignore ads too but it feels like an ecosystem-level tragedy",
      "time": 1770384160,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "nicbou",
      "id": 46912368,
      "kids": [
        46912672,
        46912543,
        46912767
      ],
      "parent": 46912226,
      "text": "I do not have that filter, but I have been using ad blockers for so long that my tolerance for ads is near zero. Being interrupted by an ad is enough for me to close the tab or turn the device off.<p>I can&#x27;t imagine what it&#x27;s like to access modern websites unfiltered.",
      "time": 1770383204,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "jraph",
      "id": 46912319,
      "parent": 46912226,
      "text": "Possibly an instance of banner blindness<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Banner_blindness\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Banner_blindness</a>",
      "time": 1770382913,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "ben_w",
      "id": 46912373,
      "parent": 46912226,
      "text": "For me, it depends on how well-disguised the ad is. Ads quietly sitting there, informing? Those I blank out. The big flashy animations? Those make me switch to reader mode, or leave the domain entirely.<p>I do sometimes find I&#x27;m accidentally clicking on the ads at the top of search engine results, though for this case it&#x27;s extra ironic as the ad is for the real thing I&#x27;m searching for which is 2 results further down the list, and I only realise I clicked on an ad when the link goes via an ad-tracking domain that I block.<p>I&#x27;ve recently been fooled by an ad in reddit that was pretending to be news, which took me to a fake BBC website. First hint, I also block the BBC domain (nothing wrong with them, it&#x27;s just a habit I want to get out of given I don&#x27;t live in the UK any more).",
      "time": 1770383249,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "cheschire",
      "id": 46912302,
      "kids": [
        46912611
      ],
      "parent": 46912226,
      "text": "Gamecopyworld… now there’s a name I have not heard in a long time.<p>I feel the same though. My only complaint when Adblockers fail is that I have to scroll so much to read some articles on some sites. Sure, there may be some level of subconscious registration occurring in my brain for maybe the company logo, but it’s usually minimal.",
      "time": 1770382839,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "TimByte",
      "id": 46912485,
      "parent": 46912226,
      "text": "I think a lot of people who grew up on the early web have that reflex",
      "time": 1770384007,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "brk",
      "id": 46912607,
      "parent": 46912506,
      "text": "I am surprised you could look at that page and expect to receive a quality product. The images all look like really low grade AI-generated renderings. The mug in the cupholder and the giftbox image in particular don&#x27;t stand up to even casual scrutiny.<p>Not trying to make your situation worse, I just find it interesting what these sites are able to get away with to get people to part with their money.",
      "time": 1770384716,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "gramie",
      "id": 46912942,
      "parent": 46912506,
      "text": "Are you saying that something about this product is suspect? But it has &quot;Beautiful Craftsamnship&quot;!<p><a href=\"https:&#x2F;&#x2F;img-va.myshopline.com&#x2F;image&#x2F;store&#x2F;1731468034215&#x2F;1dd40a2b58c4355aff91c01535b48f41.png\" rel=\"nofollow\">https:&#x2F;&#x2F;img-va.myshopline.com&#x2F;image&#x2F;store&#x2F;1731468034215&#x2F;1dd4...</a>",
      "time": 1770386597,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "WarmWash",
      "id": 46912643,
      "parent": 46912506,
      "text": "Maggie Mcguagh on Instagram&#x27;s whole schtick is buying and reviewing these fake AI generated products. Its pretty hilarious<p>[1]<a href=\"https:&#x2F;&#x2F;www.instagram.com&#x2F;maggiemcgaugh\" rel=\"nofollow\">https:&#x2F;&#x2F;www.instagram.com&#x2F;maggiemcgaugh</a>",
      "time": 1770384892,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "meindnoch",
      "id": 46912958,
      "parent": 46912506,
      "text": "Wtf. How could you fall for such an obvious scam? Are you under 5 years old? Or over 60?",
      "time": 1770386733,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "easywood",
      "id": 46912671,
      "parent": 46912506,
      "text": "I am very curious what the product really looked like.",
      "time": 1770385026,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "sieep",
      "id": 46912542,
      "parent": 46912506,
      "text": "so you&#x27;re saying this is a real product and the ad you saw(then purchased from) was a fake?",
      "time": 1770384342,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "forinti",
      "id": 46913048,
      "parent": 46912984,
      "text": "In the 1980&#x27;s TV ads in Uruguay were really simple. Some were just a static bi-colour image of a shoe or a coat, some text, and a voice would say &quot;buy shoes at such shop at such address&quot;.<p>I guess that was at the same time the low point of marketing and also its most honest stage.",
      "time": 1770387228,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "stavros",
      "id": 46912181,
      "kids": [
        46912240
      ],
      "parent": 46912089,
      "text": "Because the sets of people who would give money to this and people who notice the Gemini logo are disjoint.",
      "time": 1770382143,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "reliabilityguy",
      "id": 46912261,
      "parent": 46912089,
      "text": "&gt; Somehow, he or she was still convinced and put it up.<p>It is intentional. People who will not notice, are the least likely to complain later.<p>Do you know why all these “Nigerian prince” emails are of a very specific style?",
      "time": 1770382680,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "sumtechguy",
      "id": 46912438,
      "kids": [
        46912703,
        46912519
      ],
      "parent": 46912134,
      "text": "On top of that, that thing takes a bunch of fiddling in their own GUI to disable.  I want a search bar for my home page.  Nothing else.  Then every once and awhile it will &#x27;forget&#x27; its settings and put it all back.  Edge&#x2F;Chrome makes no difference to me it is the same code.  But that first tab experience with edge is garbage.  Probably why I mostly use Firefox still.",
      "time": 1770383735,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "larodi",
      "id": 46912153,
      "kids": [
        46912221
      ],
      "parent": 46912134,
      "text": "Why does it even exist, this MSN page, which is ridden with nonsense...? I don&#x27;t get it.",
      "time": 1770382008,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "throw_m239339",
      "id": 46912273,
      "parent": 46912134,
      "text": "At least one  can quicly hide that filth. Unbearable, in every language...",
      "time": 1770382731,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "colesantiago",
      "id": 46913042,
      "parent": 46912904,
      "text": "I agree.<p>I clicked on the daring fireball link and immediately saw an intrusive ad.<p>They are just everywhere, the web was never like this in the beginning.<p>A complete scourge.",
      "time": 1770387192,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "ljm",
      "id": 46912389,
      "parent": 46912098,
      "text": "Every now and then there&#x27;s a post on Reddit like &quot;I ordered this thing from UNARFI and it is nothing like the pictures&quot; and I&#x27;m like, what do you expect when ordering from a site named after an incorrect guess on wordle?",
      "time": 1770383338,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "mrweasel",
      "id": 46912284,
      "parent": 46912098,
      "text": "Right, unless we&#x27;re talking ads for a brand I already know and trust, I just assume that all ads are scams. Even Googles ads, which was previous very good at finding me the products I wanted, from good sources, a now overrun by scams (or borderline scams).<p>The online adverting industry is raking in billions on scamming people, while providing questionable value for actual good brands. Even if your company is honest and makes good products, you&#x27;re competing with the scammers for ad space and that pushes up your cost.<p>I&#x27;ve said this on multiple occasions, but I do not believe that the honest companies are able to fund the tech industry in it&#x27;s current form. Meta, Google, Apple and everyone else, expects increasing revenue, year on year, most of which is suppose to be delivered by ads, bought by other companies. Those companies just aren&#x27;t see the same level of growth, nor do they see enough value from ads to increase their advertising. So the big websites take in more and more questionable ads to pad their numbers. So what if consumers get scammed? They should have been more critical.",
      "time": 1770382764,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "chrystalkey",
      "id": 46912428,
      "parent": 46912258,
      "text": "Very witty",
      "time": 1770383665,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "lastofthemojito",
      "id": 46912530,
      "kids": [
        46912773
      ],
      "parent": 46912463,
      "text": "&gt; around 40% of users in the West use ad-blockers at least some of the time<p>And doubtless many of them use intentionally use TikTok, Instagram, YouTube, etc, where &quot;influencers&quot; subtly (or not-so subtly) advertise to them in the native format of the platform.",
      "time": 1770384299,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "isoprophlex",
      "id": 46912093,
      "kids": [
        46912128,
        46912163,
        46912204,
        46912200
      ],
      "parent": 46912070,
      "text": "Then what do i move to? No linux laptop feels as good to touch as the aluminum macbooks, and in terms of phones it can&#x27;t get any worse than the ads-and-trackers shitshow that is android...",
      "time": 1770381627,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "sumtechguy",
      "id": 46912524,
      "parent": 46912194,
      "text": "There is a new trick a lot of them are using on YT.  Basically it will be a person doing a &#x27;vlog&#x27;.  But it is mostly just kind of feel good stuff.  But in the middle they will mention some product that made whatever they are blathering about feel better with the coinvent link in the description.  Then they finish the video.<p>I have seen a bunch of these.  It is a wildly subtle way to get referral points.  As the AI part is making it supper easy to mill these things out.<p>The most wild one I have seen is the &#x27;ai scott adams&#x27;.  The tone is in the right ballpark.  Still a little odd but looking better after their first few attempts.  I expect soon it will drop random adverts here and there.  With the long con being getting people to watch it, then farm them.",
      "time": 1770384274,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "api",
      "id": 46912213,
      "kids": [
        46912375,
        46912572
      ],
      "parent": 46912194,
      "text": "The best are the one trick doctors don’t tell you or the thing THEY don’t want you to know about.<p>A lot of scams and cons are deliberately stupid looking and absurd to pre-select for gullible marks.<p>It’s also why goofy conspiritainment shows are loaded with ads for quack medicines. Anyone who thinks we didn’t go to the moon will probably buy herbal dick pills.",
      "time": 1770382350,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "redserk",
      "id": 46912232,
      "kids": [
        46912372
      ],
      "parent": 46912115,
      "text": "I unsubscribed from the News app subscription over their decision to bake in ads.<p>I own multiple personal Mac computers, an iPhone, an Apple Watch, iPad Pro, a few HomePods, and a few Apple TV devices. I’ve already proven that I’m willing to pay for a product even when there are cheaper alternatives. Why they decided to make News a paid subscription with ads — especially low-quality ads is beyond me.<p>I’ve gotten to the point where I’ve deleted the News, Stocks, and Weather apps, and will just remove any additional apps they decide to chuck in. It’s a real shame their aggressive pursuit of services revenue is destroying what is a great hardware ecosystem.",
      "time": 1770382491,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "Y-bar",
      "id": 46912598,
      "parent": 46912115,
      "text": "&quot;Services Revenue must go up! If one ad network pays us 2% more use it!&quot;<p>-- Tim &quot;Apple&quot; Cook (paraphrased)<p>Actual quote from a few days ago:<p>&gt; “Services also achieved an all-time revenue record, up 14 percent from a year ago [...] a testament to incredible customer satisfaction for the very best products and services in the world.”",
      "time": 1770384655,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "kotaKat",
      "id": 46912148,
      "parent": 46912115,
      "text": "I’m kind of (un)surprised to see it just be Taboola’s slop from the ages past. I forgot Taboola even still pushes that garbage.",
      "time": 1770381977,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "askl",
      "id": 46912272,
      "kids": [
        46912328
      ],
      "parent": 46912115,
      "text": "&gt; legitimate advertisers<p>Those two words definitely don&#x27;t belong together.",
      "time": 1770382730,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "Y-bar",
      "id": 46912560,
      "parent": 46912296,
      "text": "Doesn&#x27;t make it any better.",
      "time": 1770384443,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "matsemann",
      "id": 46912136,
      "kids": [
        46912446
      ],
      "parent": 46912063,
      "text": "While I understand the sentiment, most ads for a long time were fairly reputable? Like in the news papers, most ads were to make you aware of a brand (next car I buy I&#x27;ll feel safe buying X because I&#x27;ve seen it in the papers), or to notify you about a local store having a sale etc. And disabling my ad blocker and going to a page I see ads for house listings nearby, offers to buy sports gear in a store in my city, and ads for a well known telecom company. All things I would trust.<p>What I don&#x27;t understand is why high-value brands sell their screen estate to straight up scams or low quality ads.",
      "time": 1770381914,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "nottorp",
      "id": 46912084,
      "kids": [
        46912112
      ],
      "parent": 46912063,
      "text": "Exactly. Why did the article author think ads weren&#x27;t scams before they were &quot;AI&quot; generated?",
      "time": 1770381581,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "Yossarrian22",
      "id": 46912357,
      "parent": 46912063,
      "text": "I see an ad for a product I bought and it makes me worried I got scammed. The usual offender is Peak Design.",
      "time": 1770383157,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "latexr",
      "id": 46912123,
      "parent": 46912063,
      "text": "Yes, of course. These exist because they work. If no one fell for these scams, they wouldn’t continue to exist.",
      "time": 1770381791,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "Tyr42",
      "id": 46912224,
      "parent": 46912063,
      "text": "I mean I remember when Penny Arcade Ram ads for games and such and they only ran the ads if the approved of the game.  The ads were worth clicking into.  They sold a real product for a cost approximating its value.<p>Now ads are just scams",
      "time": 1770382419,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "mcphage",
      "id": 46912114,
      "kids": [
        46912223
      ],
      "parent": 46912063,
      "text": "&gt; Are there any ads that people do trust?<p>What?  Yes, of course.  Are you so terminally online that you assume all advertising is the fake AI chum that we see on the web?",
      "time": 1770381736,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "bilsbie",
      "id": 46912283,
      "parent": 46912063,
      "text": "HN users are mostly 1980s levels of institutional and media trust. Not sure why.",
      "time": 1770382758,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "wtetzner",
      "id": 46912764,
      "parent": 46912211,
      "text": "Apple News is a paid subscription. Facebook and Google are not. Apple is supposedly the premium brand that provides a curated experience (isn&#x27;t that their reasoning behind the closed nature of the App Store?).",
      "time": 1770385586,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "7952",
      "id": 46912244,
      "parent": 46912211,
      "text": "That could make sense as a criticism if Apple were some tiny struggling company.  But they have the resources to do better. And a brand identity that definitely sets it apart from the rest of the internet.",
      "time": 1770382546,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "FabHK",
      "id": 46912239,
      "parent": 46912211,
      "text": "Still a bit of a bummer that with Apple, you pay a premium to escape the ad-based ecosystem^W cesspool, both for the hardware and then here for Apple News itself, and then still not only get served ads, but tasteless scam ads.",
      "time": 1770382530,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "marxisttemp",
      "id": 46912250,
      "parent": 46912211,
      "text": "I’m an Apple cultist but it is somewhat comical that Apple has their own content blocking format built into their own browser but somehow thinks I’d ever want to pay for a subscription to read ad-encumbered news in a separate webview app",
      "time": 1770382569,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "D13Fd",
      "id": 46912916,
      "parent": 46912709,
      "text": "Fitness+ is actually super high quality, really well integrated with Apple’s products, and fun to use. I love it. I would happily pay the monthly Apple fee just for fitness+. I hope they don’t change it.<p>If there is anything that represents a “services strategy” like the Apple of the Jobs era, it’s fitness+.",
      "time": 1770386488,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "esskay",
      "id": 46912982,
      "kids": [
        46913055
      ],
      "parent": 46912709,
      "text": "Arcade is comically poor value. I can&#x27;t tell if Apple doesn&#x27;t care, or they&#x27;re just so deluded due to their insular nature and crap attitude towards gaming that they genuinely think its a good service to offer mediocre mobile games for a premium.",
      "time": 1770386878,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "jangxx",
      "id": 46912846,
      "parent": 46912709,
      "text": "I actually like Fitness+, it got me working out for the first time in my life.",
      "time": 1770386052,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "addicted",
      "id": 46912889,
      "kids": [
        46913004
      ],
      "parent": 46912709,
      "text": "&quot;customer&quot; is a much better term IMO. It indicates this is ultimately a transactional relationship where both sides have certain responsibilities. The customer the responsibility to provide the money, and the provider receiving the money has a responsibility to provide the customer with something, products or services, of value that makes their lives better.<p>&quot;user&quot; is a worse term. It suggests that the &quot;user&quot; is simply utilizing the provider&#x27;s products&#x2F;services, and therefore they can&#x27;t really complain about whatever the provider chooses to do in return, because the &quot;user&quot; can simply stop using.<p>It&#x27;s also not a coincidence, IMO, that drug addicts are also called &quot;users&quot; since &quot;user&quot; implies a one way dependent relationship and that&#x27;s what all the tech companies have been trying to create.",
      "time": 1770386325,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "kranke155",
      "id": 46912927,
      "parent": 46912768,
      "text": "Yes on the last count for Apple U.<p>The culture of excellence is just not there. Big company but not sure if it’s a live player atm. Lots of unrefined experiences.<p>People say it’s Tim Cook as if Apple had a bunch of CEOs. In its modern incarnation it was basically Jobs and Cook. But there were some major improvements under Cook and some major disappointments. Hardware seems to be doing well, software not so much.",
      "time": 1770386550,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "lotsofpulp",
      "id": 46912886,
      "parent": 46912659,
      "text": "90% of the content in the News+ app is itself an ad.",
      "time": 1770386307,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "givinguflac",
      "id": 46912833,
      "parent": 46912659,
      "text": "You can definitely block ads- try NextDNS.",
      "time": 1770385988,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "Terretta",
      "id": 46912985,
      "parent": 46912763,
      "text": "This <i>sounds</i> brilliant, makes too much sense, and suggests a new kind of ad blocker to escalate and reflect retribution back.<p>Unrelated:  Once upon a time it was believed ads should pair with content, not with users.  It&#x27;s been proven to still be more effective.  Problem (for advertisers) is reach vs. cost of producing ads that content-align.  In any case, Apple has enough reach they could <i>easily</i> bring ad sales in-house.  Plenty TV shows, the show owner retains rights to ad slots partly to ensure no brand damage to show and partly to <i>make more money per slot</i>.",
      "time": 1770386895,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "digiown",
      "id": 46912902,
      "parent": 46912763,
      "text": "That&#x27;s why you block ALL ads. Starve the beast. If an app has ads, I do not use it, end of story.",
      "time": 1770386424,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "threetonesun",
      "id": 46912697,
      "parent": 46912566,
      "text": "Pre LLMs I would have said the all-text format of HN probably kept the astroturfing low, but these days I&#x27;m less sure. It&#x27;s still a much less engaging format than almost any other place on the web, although again, with LLMs you can even cheaply target the lowest value returns.",
      "time": 1770385159,
      "type": "comment",
      "depth": 2
    }
  ]
}