{
  "story": {
    "by": "toomuchtodo",
    "descendants": 3,
    "id": 46914094,
    "kids": [
      46914280
    ],
    "score": 20,
    "time": 1770392085,
    "title": "NIMBYs Aren't Just Shutting Down Housing",
    "type": "story",
    "url": "https://inpractice.yimbyaction.org/p/nimbys-arent-just-shutting-down-housing"
  },
  "article_text": "NIMBYs Aren’t Just Shutting Down Housing\nThey want to shut down our right to be heard in the first place.\nHere’s a guest post by Sonja Trauss, Executive Director of YIMBY Law, on the troubling ideas behind the recent complaint to the state bar association.\nA few months ago we at YIMBY Law [scored a remarkable victory](https://inpractice.yimbyaction.org/p/how-we-forced-the-richest-retirement) in Rancho Palos Verdes, an affluent city on the coast in Southern California — lobbying the city council to approve an upzoning that would allow 647 homes.\nWe did it by taking advantage of the democratic process. After finding out that the city council was considering a housing element that would have bowed to NIMBY pressure, we sent two letters to the city, reminding it of its legal obligations under state law to approve the upzoning — and that a failure to do so would open the city up to a lawsuit. Not only were we well within our rights to send those letters, we were right on the merits too.\n[As we wrote in the second letter](https://docs.google.com/document/d/1JJTq_EmAmftTmmeWtEwLXbYBMoca1K5e/edit):\nThe options in front of you are to respect the efforts of your staff which led to a Housing Element and subsequent rezoning AND an application consistent with those measures, or to waste time and open yourselves to our lawsuit while crippling your ability to meet the statutory RHNA obligation.\nThese letters, which we often send to cities, are frankly delightful to send. Thanks to our work and the work of our allies, city councils in California tempted to vote against fulfilling their housing obligations are hemmed in from three directions — either [approving the housing under SB 9](https://www.hcd.ca.gov/sites/default/files/docs/planning-and-community/sb-9-fact-sheet.pdf), facing the [builder’s remedy](https://www.yimbylaw.org/buildersremedy), or [a lawsuit under the Housing Accountability Act](https://sfyimby.com/2023/03/twelve-years-after-proposal-terrace-of-lafayette-approval-upheld-by-court.html). All roads lead to new housing. It’s delightful.\nBut NIMBYs in SoCal were less delighted. As you might have read in the [San Francisco Chronicle](https://www.sfchronicle.com/realestate/article/sonja-trauss-yimby-21309436.php), one of them filed a complaint with the California State Bar, saying that I was practicing law without a license. They said because I’m not an attorney (which is true), I was offering “legal analysis,” which only licensed attorneys are allowed to do.\nHere’s an excerpt of the letter that the state bar sent me (I’m leaving out the name of the person who filed the complaint, but keeping their typos).\nOur office has received a complaint [...] alleging that you are practicing law without a license in California. The complaint alleges that you [and] Yimby Law writes letters to CA cities threatening legal action and stating incorrect housing laws and city ordinance laws.\nREDACTED includes with [their] complaint a copy of a letter you sent to the City of Rancho Palos Verdes/Citty [sic] Council on March 17, 2025. Your letter provides a legal analysis related to removal of certain sites from the “Housing Site Inventory.”\nThis is, to put it mildly, preposterous. Not only am I not holding myself out as an attorney, but, [as the Institute for Justice pointed out in their response to the state bar](https://ij.org/press-release/public-interest-law-firm-stands-with-california-yimby-advocacy-group-to-protect-first-amendment-rights/), sending letters like these are protected under not one but two clauses of the First Amendment — the right to free speech and the right to petition the government.\nAs part of our work, YIMBY Law sends letters to cities in California that remind them of their obligations under state laws like [the Housing Accountability Act](https://en.wikipedia.org/wiki/California_Housing_Accountability_Act). Those letters say something different each time, but the general gist usually is: “Hey, we saw you are thinking about taking some action that seems like it would violate state law. You shouldn’t do that. And if you do, we might sue you, and if we do we tend to win.” Most of the time, our letters never turn into lawsuits. We send a letter and city officials realize that not only are we right, it’s not worth the hassle of fighting in court. So they do the right thing. This is the kind of thing that we and other YIMBY groups have done ever since [the lawsuit against the East Bay suburb of Lafayette](https://sfyimby.com/2023/03/twelve-years-after-proposal-terrace-of-lafayette-approval-upheld-by-court.html). (You can see the whole list of those cases [here](https://www.yimbylaw.org/past-lawsuits).) Most recently, we’re [suing the state of California](https://www.latimes.com/california/story/2025-12-10/pro-housing-group-sues-newsom-over-duplex-ban-in-wildfire-zones) over the governor’s executive order restricting duplexes in the areas affected by the Palisades fire.\nI am confident that the state bar will agree with the Institute for Justice here, which cited case after case in which the courts have held that this kind of advocacy work is squarely protected no matter if a person is an attorney, not an attorney, offering legal analysis, not offering legal analysis, right on the merits, wrong on the merits, fighting for a good cause, or fighting for a bad one. The First Amendment protects our right to lobby the government as much as it protects the rights of the AARP, the NRA, the American Heart Association, the California Nurses Association, Liveable California, the League of California Cities, the Group In Favor of That Thing You Love, and the Group in Favor of That Thing You Absolutely Hate.\nIt’s important to be really clear about this — not only do NIMBYs like the one who filed this complaint think that we are wrong about housing, they don’t even think we should be allowed to argue for more housing. They don’t think we are even entitled to a fair hearing. We should all recognize that silencing your political rivals is beyond the pale and that complaints like this one, even if they end up going nowhere, can have a chilling effect on activists and ordinary people who want to exercise their rights.\nSpeaking as an activist, this kind of delegitimization is a NIMBY tactic we have to put up with all the time. Not only do NIMBYs think we are wrong, a lot of them seem to think that we don’t even get to have a say. There’s a pretty consistent undercurrent to a lot of NIMBYism that can’t even imagine why somebody would be in favor of more housing and laws that make it easier to build it. Something about us breaks their brains. That’s frustrating. Democracy only works when we can have [free-ranging conversation with each other](https://thepointmag.com/politics/a-republic-of-discussion-habermas-at-ninety/). The only rules really are that you should give reasons for what you believe and that you shouldn’t force anybody else out of the discussion.\nThere are plenty more examples. One of the first times my colleague Laura Foote, the Executive Director of YIMBY Action sent a San Francisco Supervisor an email expressing her opinion on public policy, they wrote back asking “What’s that area code, where are you from?” The message being — it wasn’t 415 and therefore she didn’t count. One of the most common tropes in the early days of press coverage was journalists implying — or outright stating — that we were shills for the real-estate industry, as if they couldn’t believe someone would actually be in favor of more housing if they weren’t being paid to do it. We still get called shills sometimes, when we aren’t being called [gentrifiers](https://realprogressives.substack.com/p/yimbyism-is-code-for-gentrification), [inhuman](https://allaspectreport.com/2025/06/21/the-cruel-inhumanity-of-the-yimby-movement/), [alt-right](https://truthout.org/articles/yimbys-the-alt-right-darlings-of-the-real-estate-industry/), [white supremacists](https://medium.com/@tdfischer_/the-progressive-disinformation-machine-7281184cac3f), and — for some reason I cannot explain — [Scientologists](https://www.citywatchla.com/voices/25290-yimbyism-there-s-a-whole-lot-of-shilling-going-on). (Yes In Xenu’s Backyard, I guess.)\nIt’s not just online delegitimation. It’s distressingly common that when we show up at public meetings that NIMBYs will boo and hiss at us while we are talking. Laura was at a public meeting once in Cupertino where the NIMBYs in the crowd started shouting “Where are you from? Where are you from?” She started quoting Martin Luther King saying that an “injustice anywhere is an injustice everywhere,” when a woman who later got elected to the city council ran up and pulled the microphone from her hand.\nNIMBYs in Santa Monica convinced the state Fair Political Practices Committee that the mayor pro tem had [to recuse himself](https://www.smdp.com/state-regulators-say-councilman-zwick-is-conflicted-on-housing-votes/) from votes on housing because he worked for the Housing Action Committee. (If you think that makes sense, ask yourself if a mayor pro tem who also happened to work for a gun control group should have to recuse themselves from voting on a gun control measure? Or, more to the point, if a mayor pro tem who owned property and didn’t want the competition should recuse themselves from a zoning vote?)\nMore recently, a San Rafael [planning commission](https://www.cityofsanrafael.org/public-hearing-for-project-at-700-irwin/) hearing on a proposal for mixed-income housing became so heated that an opponent spat on a commenter supporting it.\nIn a democracy, even an imperiled one like ours, one of the most important things we can do is to not spit on each other for having different opinions. That seems pretty minimal and something that we could all agree on, even if we don’t agree on housing.",
  "comments": [
    {
      "by": "darkwater",
      "id": 46914280,
      "kids": [
        46914327,
        46914364,
        46914318
      ],
      "parent": 46914094,
      "text": "It&#x27;s this really YIMBY or actually YIYBY ? It&#x27;s difficult to tell checking the whole website.<p>Edit to be more explicit: are the people that sent&#x2F;asked to send the 2 letters to the City Council residents of Rancho Palos Verdes?",
      "time": 1770392933,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "epistasis",
      "id": 46914327,
      "parent": 46914280,
      "text": "If you&#x27;re going to invent the term YIYBY are you willing to acknowledge far more NIYBY than NIMBY behavior?",
      "time": 1770393137,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "moron4hire",
      "id": 46914364,
      "parent": 46914280,
      "text": "[delayed]",
      "time": 1770393276,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "cbeach",
      "id": 46914318,
      "parent": 46914280,
      "text": "Definitely YIYBY.",
      "time": 1770393104,
      "type": "comment",
      "depth": 1
    }
  ],
  "chat_history": []
}