{
  "story": {
    "by": "thm",
    "descendants": 113,
    "id": 46911869,
    "kids": [
      46912047,
      46912562,
      46912945,
      46912584,
      46912077,
      46913297,
      46912664,
      46912970,
      46913253,
      46912955,
      46912037,
      46912679,
      46912290,
      46912849,
      46912967,
      46912784,
      46913073,
      46912858,
      46912870,
      46912943,
      46913009,
      46912991,
      46912548,
      46912690,
      46912351,
      46912347,
      46912301,
      46912457,
      46912214,
      46912156,
      46912758
    ],
    "score": 162,
    "time": 1770379908,
    "title": "TikTok's 'Addictive Design' Found to Be Illegal in Europe",
    "type": "story",
    "url": "https://www.nytimes.com/2026/02/06/business/tiktok-addictive-design-europe.html"
  },
  "article_text": "Failed to extract text: Client error '403 Forbidden' for url 'https://www.nytimes.com/2026/02/06/business/tiktok-addictive-design-europe.html'\nFor more information check: https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/403",
  "comments": [
    {
      "by": "erzhan89",
      "id": 46912047,
      "parent": 46911869,
      "text": "<a href=\"https:&#x2F;&#x2F;archive.is&#x2F;V1NPt\" rel=\"nofollow\">https:&#x2F;&#x2F;archive.is&#x2F;V1NPt</a>",
      "time": 1770381334,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "jamesblonde",
      "id": 46912562,
      "kids": [
        46913100,
        46913145,
        46913035,
        46913152
      ],
      "parent": 46911869,
      "text": "I gave a talk at PyData Berlin on how to build your own TikTok recommendation algorithm. The TikTok personalized recommendation engine is the world&#x27;s most valuable AI. It&#x27;s TikTok&#x27;s differentiation. It updates recommendations within 1 second of you clicking - at human perceivable latency. If your AI recommender has poor feature freshness, it will be perceived as slow, not intelligent - no matter how good the recommendations are.<p>TikTok&#x27;s recommender is partly built on European Technology (Apache Flink for real-time feature computation), along with Kafka, and distributed model training infrastructure. The Monolith paper is misleading that the &#x27;online training&#x27; is key. It is not. It is that your clicks are made available as features for predicitons in less than 1 second. You need a per-event stream processing architecture for this (like Flink - Feldera would be my modern choice as an incremental streaming engine).<p>* <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=skZ1HcF7AsM\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=skZ1HcF7AsM</a><p>* Monolith paper - <a href=\"https:&#x2F;&#x2F;arxiv.org&#x2F;pdf&#x2F;2209.07663\" rel=\"nofollow\">https:&#x2F;&#x2F;arxiv.org&#x2F;pdf&#x2F;2209.07663</a>",
      "time": 1770384446,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "eggy",
      "id": 46912945,
      "kids": [
        46913079,
        46913159,
        46913123,
        46913116,
        46913168,
        46913084
      ],
      "parent": 46911869,
      "text": "I&#x27;m skeptical about banning design patterns just because people might overuse them. Growing up, I had to go to the theater to see movies, but that didn&#x27;t make cliffhangers and sequels any less compelling. Now we binge entire Netflix series and that&#x27;s fine, but short-form video needs government intervention?\nThe real question is: where do we draw the line between protecting people from manipulative design and respecting their ability to make their own choices? If we&#x27;re worried about addictive patterns, those exist everywhere—streaming platforms, social feeds, gaming, even email notifications.\nMy concern isn&#x27;t whether TikTok&#x27;s format is uniquely dangerous. It&#x27;s whether we trust adults to manage their own media consumption, or if we need regulatory guardrails for every compelling app. I&#x27;d rather see us focus on media literacy and transparency than constantly asking governments to protect us from ourselves.<p>You can&#x27;t legislate intelligence...",
      "time": 1770386618,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "llbbdd",
      "id": 46912584,
      "kids": [
        46912793,
        46912745,
        46912726
      ],
      "parent": 46911869,
      "text": "Idk how to feel about this specifically but I kind of hope they come for Duolingo next. They are up to some similar mind hacking shit to keep people from leaving. There&#x27;s the downright abusive streak management tactics that have become a major part of their brand and PR, and the lesson plans seem designed to plateau to prevent you from actually getting proficient enough in a language to ever unsub. They reset your cleared lessons and require you to redo them if they add new vocab to them, as well as randomly clearing them in the name of making you practice them again. I don&#x27;t know what the solution is but I&#x27;ve known multiple people now who&#x27;ve gotten frustrated and blamed themselves for not being able to advance their skills with a language, but Duolingo&#x27;s business model, like Tinder&#x27;s, is completely opposed with the goals of their users. If Duolingo R&amp;D discovered a magical new method of making you fluent in a language overnight, they would not sell it to you. Tinder R&amp;D might have discovered the actual honest-to-God formula for True Love years ago and burned it because they can make more if you swipe forever.",
      "time": 1770384582,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "lozenge",
      "id": 46912077,
      "kids": [
        46912544,
        46912212,
        46912380
      ],
      "parent": 46911869,
      "text": "I don&#x27;t understand the legal side, but after gaining and kicking a Tiktok addiction during and after COVID, I believe it. I was there 4-8 hours a day and tried to scroll videos while washing dishes (and during nearly any other activity).",
      "time": 1770381533,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "uriahlight",
      "id": 46913297,
      "kids": [
        46913330
      ],
      "parent": 46911869,
      "text": "Europeans really need to get their heads out of their butts. Their solution to every problem is nanny state regulation.",
      "time": 1770388379,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "Retr0id",
      "id": 46912664,
      "kids": [
        46913205,
        46913169,
        46912681
      ],
      "parent": 46911869,
      "text": "The press release: <a href=\"https:&#x2F;&#x2F;ec.europa.eu&#x2F;commission&#x2F;presscorner&#x2F;detail&#x2F;en&#x2F;ip_26_312\" rel=\"nofollow\">https:&#x2F;&#x2F;ec.europa.eu&#x2F;commission&#x2F;presscorner&#x2F;detail&#x2F;en&#x2F;ip_26_...</a><p>&gt; At this stage, the Commission considers that TikTok needs to change the basic design of its service. For instance, by disabling key addictive features such as ‘infinite scroll&#x27; over time, implementing effective ‘screen time breaks&#x27;, including during the night, and adapting its recommender system.<p>Most of these seem concretely doable, and maybe effective. But the core of the addictiveness comes from the &quot;recommender system&quot;, and what are they supposed to do there? Start recommending worse content? How much worse do the recommendations have to be before the EC is satisfied?",
      "time": 1770384988,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "Aurornis",
      "id": 46912970,
      "parent": 46911869,
      "text": "The headline overstates what actually happened. Ironic that they’re using clickbait headlines on an article about a service using tricks to get people to engage with something.<p>They haven’t concluded anything yet. It’s early in the process and they’re opening the process of having TikTok engage and respond.<p>The article starts with a headline the makes it sound like the conclusion was already made, then the more you read the more it becomes clear that this is the early part of an investigation, not an actual decision.<p>&gt; Now European Union regulators say those same features that made TikTok so successful are likely illegal.<p>&gt; No timeline was given on when authorities will make a final decision in the case.",
      "time": 1770386807,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "amadeuspagel",
      "id": 46913253,
      "kids": [
        46913289
      ],
      "parent": 46911869,
      "text": "Banning infinite scroll comes close to banning good design. If removing pointless interruptions is illegal, we might as well throw every designer in prison. And why stop there? Why not force TikTok to add other pointless barriers, like making the user solve a puzzle before watching another video? What about other uninterrupted experiences, like watching TV?<p>I find twitter more addictive then TikTok. Should it be forced to make me click &quot;next&quot; before seeing another tweet?<p>Banning recommendation engines is also incredible. Is it really the EU&#x27;s case that they&#x27;re all illegal, from the youtube recommendation engine to amazon&#x27;s &quot;people who bought this also bought&quot; to twitter&#x27;s &quot;who to follow&quot;? Is TikTok&#x27;s just too good?",
      "time": 1770388161,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "pier25",
      "id": 46912955,
      "parent": 46911869,
      "text": "I only tried it once and like 30 mins passed in the blink of an eye. Never again.",
      "time": 1770386714,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "RobotToaster",
      "id": 46912037,
      "kids": [
        46912263,
        46912197,
        46912068,
        46912238,
        46912478,
        46912309
      ],
      "parent": 46911869,
      "text": "&gt; On Friday, the regulators released a preliminary decision that TikTok’s infinite scroll, auto-play features and recommendation algorithm amount to an “addictive design” that violated European Union laws for online safety.<p>How is that any different to Facebook?",
      "time": 1770381286,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "graemep",
      "id": 46912679,
      "parent": 46911869,
      "text": "No, one branch of the EU (not European) government has said it is likely (there has been no ruling) that its illegal.<p>Its a good thing, but its not what the title says it is",
      "time": 1770385075,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "glimshe",
      "id": 46912290,
      "kids": [
        46913339,
        46912874,
        46912797,
        46912464
      ],
      "parent": 46911869,
      "text": "Maybe I don&#x27;t get addicted easily, but after 30 minutes of forcing myself to watch tiktok, I just uninstalled it. Friends told me I didn&#x27;t give it enough time to learn my tastes but... How could it, given that literally 100% of the videos in my interest areas were trash?",
      "time": 1770382804,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "SlightlyLeftPad",
      "id": 46912849,
      "parent": 46911869,
      "text": "I hope they go after Whatnot,  Youtube shorts, and LinkedIn as well.<p>LinkedIn has become such a pit of force-fed self-help vitriol it’s completely lost its purpose.",
      "time": 1770386061,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "heyheyhouhou",
      "id": 46912967,
      "parent": 46911869,
      "text": "They should do the same with Instagram and Youtube shorts... but wait, they are not chinese, they are allowed to mine us...",
      "time": 1770386790,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "delichon",
      "id": 46912784,
      "kids": [
        46912920
      ],
      "parent": 46911869,
      "text": "I use X almost entirely from the desktop where I have an extension installed that lets me whitelist my follows, and see nothing else. I recently browsed the same feed on mobile ... and it was entirely different! I think I spent a half hour and saw zero content from my follows, just one ticktok style video after another. For those who find these services without value, I now understand. But I feel revolted rather than addicted. Will I now experience a mysterious compulsion to view the naked feed?",
      "time": 1770385726,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "bdcravens",
      "id": 46913073,
      "kids": [
        46913273
      ],
      "parent": 46911869,
      "text": "So what&#x27;s next, Hacker News is illegal because the point system encourages retention?",
      "time": 1770387359,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "semiquaver",
      "id": 46912858,
      "parent": 46911869,
      "text": "Just curious for anyone who pays more attention to this than me: is the company being sanctioned by the EU for this behavior the one that US law forced an ownership change of or does that company only operate in the US?",
      "time": 1770386119,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "juancn",
      "id": 46912870,
      "parent": 46911869,
      "text": "Isn&#x27;t this exactly the same with Instagram, Snapchat, Facebook, etc.?<p>What makes TikTok different?",
      "time": 1770386218,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "concats",
      "id": 46912943,
      "parent": 46911869,
      "text": "TikTok has a lot of issues, such as privacy, dubious content, &#x27;brainrot&#x27;, etc. I don&#x27;t want to seem like I&#x27;m necessarily defending TikTok specifically here.<p>But this really just stinks of Regulatory Capture to me. Their main argument is that the consumers like to use the app too much?<p>Why? Because it&#x27;s smarter and not as enshittified as the competitors?<p>I&#x27;m sure if youtube, facebook, reddit, etc reduced the number of ads, and started showing more relevant content that people actually cared about, they too would start being &quot;more addictive&quot;. Do we really want to punish that?<p>What&#x27;s the end goal here?",
      "time": 1770386609,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "shafyy",
      "id": 46913009,
      "parent": 46911869,
      "text": "Direct link to EU Commission&#x27;s statement: <a href=\"https:&#x2F;&#x2F;ec.europa.eu&#x2F;commission&#x2F;presscorner&#x2F;detail&#x2F;en&#x2F;ip_26_312\" rel=\"nofollow\">https:&#x2F;&#x2F;ec.europa.eu&#x2F;commission&#x2F;presscorner&#x2F;detail&#x2F;en&#x2F;ip_26_...</a>",
      "time": 1770387025,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "ddmma",
      "id": 46912991,
      "parent": 46911869,
      "text": "They will pay upfront or put some geopolitical pressure\n<a href=\"https:&#x2F;&#x2F;www.bbc.com&#x2F;news&#x2F;articles&#x2F;c24g8v6qr1mo\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bbc.com&#x2F;news&#x2F;articles&#x2F;c24g8v6qr1mo</a>",
      "time": 1770386940,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "ajsnigrutin",
      "id": 46912548,
      "kids": [
        46913252,
        46912962
      ],
      "parent": 46911869,
      "text": "Might be a generational thing, but I never understood the &quot;shorts&quot; (in any format on any social network).<p>I can watch a 9 hour video on GTA games without problems (not in one sitting, but in parts), but 3 &#x27;shorts&#x27; in a row with not enough info and explanation to be interesting makes me close any of the &#x27;shorts&#x27; apps (tiktok, youtube shorts, instagram....).<p>(eg, the 9 hour video: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Faxpr_3EBDk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Faxpr_3EBDk</a> )",
      "time": 1770384360,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "christkv",
      "id": 46912690,
      "parent": 46911869,
      "text": "So will they also go after youtube?",
      "time": 1770385127,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "andrewinardeer",
      "id": 46912351,
      "parent": 46911869,
      "text": "Infinite scroll is banned on this phone. Using NextDNS.",
      "time": 1770383140,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "WhereIsTheTruth",
      "id": 46912347,
      "kids": [
        46912496,
        46912403
      ],
      "parent": 46911869,
      "text": "Funny how Europe&#x27;s &quot;concern&quot; for digital health only kicks in when a non US platform starts winning",
      "time": 1770383116,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "globular-toast",
      "id": 46912301,
      "parent": 46911869,
      "text": "Good. I feel like since cracking down on smoking in the 90s we&#x27;ve become really complacent to the dangers of addiction. Just like with smoking you&#x27;ll get people inside the industry defending it too (like in this very comment section).",
      "time": 1770382838,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "vachina",
      "id": 46912457,
      "kids": [
        46913024,
        46912481,
        46913229,
        46913140
      ],
      "parent": 46911869,
      "text": "lol. Imagine needing an authoritarian figure to dictate what you can and cannot consume. Are you that feeble minded.",
      "time": 1770383855,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "keepamovin",
      "id": 46912758,
      "parent": 46911869,
      "text": "Purity! Purity! Purity! The stewards of civilization! The guards of righteousness! Oh, Europe, how beautifully doth your actions grace this heathen world with enlightenment. Oh, Europe, glory of the Human Race, Pride of the Old Gods, may you exist a 1000 generations!",
      "time": 1770385542,
      "type": "comment",
      "depth": 0
    },
    {
      "by": "dmix",
      "id": 46913100,
      "parent": 46912562,
      "text": "I noticed Youtube shorts also seems to update the feed based on how long the last video you watched. If you&#x27;re scrolling quickly then stop to watch a dog video long enough the next one is likely to be another dog video.",
      "time": 1770387467,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "ryanjshaw",
      "id": 46913145,
      "parent": 46912562,
      "text": "Great insight. Any thoughts on RisingWave?",
      "time": 1770387648,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "Jamesbeam",
      "id": 46913152,
      "parent": 46912562,
      "text": "Pretty interesting, thanks for your work and talk.<p>On topic, I also think we won’t see much of a consequence from the new classification.<p>&quot;No timeline was given on when authorities will make a final decision in the case.&quot;<p>Typical EU commission powerbottom move.Those benchwarmers will not do a damn thing before the next round of elections.<p>All politicians and world leaders decided to stay on a platform that enables generating child pornography. Why would they leave TikTok? They want people to be addicted to theirs and their parties content on there across all political camps.",
      "time": 1770387683,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "mtoner23",
      "id": 46913079,
      "kids": [
        46913137,
        46913162,
        46913185
      ],
      "parent": 46912945,
      "text": "Short form video has been a total break from previous media and social media consumption patterns. Personally I would support a ban on algorithmic endless short form video. It&#x27;s purely toxic and bad for humanity",
      "time": 1770387373,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "zbentley",
      "id": 46913159,
      "parent": 46912945,
      "text": "&gt; It&#x27;s whether we trust adults to manage their own media consumption, or if we need regulatory guardrails for every compelling app<p>I think there&#x27;s a wide regulatory spectrum between those extremes--one that all sorts of governments already use to regulate everything from weapons to software to antibiotics.<p>It&#x27;s easy to cherry-pick examples where regulation failed or produced unexpected bad results. However, doing that misses the huge majority of cases where regulation succeeds at preventing harms without imposing problematic burdens on people. Those successes are hard to see because they&#x27;re evidenced by bad outcomes <i>failing to happen</i>, things working much as they did before (or getting worse at a slower rate than otherwise might happen).<p>It&#x27;s harder to point to &quot;nothing changed&quot; as a win than it is to find the pissed-off minority who got denied building permits for reasons they disagree with, or the whataboutists who take bad actions by governments as evidence that regulation in unrelated areas is doomed to failure.",
      "time": 1770387736,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "kranke155",
      "id": 46913123,
      "parent": 46912945,
      "text": "You should be able to pick your own algorithm. It’s a matter of freedom of choice.",
      "time": 1770387556,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "thisislife2",
      "id": 46913116,
      "parent": 46912945,
      "text": "The only reason the US and Europe are targeting TikTok is because they don&#x27;t own the platform. Facebook and WhatsApp (owned by Meta) are responsible for so much hate politics and social unrest around the world (<i>Facebook and Genocide: How Facebook contributed to genocide in Myanmar and why it will not be held accountable</i> - <a href=\"https:&#x2F;&#x2F;systemicjustice.org&#x2F;article&#x2F;facebook-and-genocide-how-facebook-contributed-to-genocide-in-myanmar-and-why-it-will-not-be-held-accountable&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;systemicjustice.org&#x2F;article&#x2F;facebook-and-genocide-ho...</a> ). Amazon, Google and Microsoft helped the Israelis conduct the genocide in Gaza with their AI tools (<i>UN Calls Out Google and Amazon for Abetting Gaza Genocide</i> - <a href=\"https:&#x2F;&#x2F;progressive.international&#x2F;wire&#x2F;2025-08-26-un-calls-out-google-and-amazon-for-abetting-gaza-genocide&#x2F;en&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;progressive.international&#x2F;wire&#x2F;2025-08-26-un-calls-o...</a> ). But all that&#x27;s OK.",
      "time": 1770387522,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "Juliate",
      "id": 46913168,
      "parent": 46912945,
      "text": "&gt; The real question is: where do we draw the line between protecting people from manipulative design and respecting their ability to make their own choices?<p>We do it for alcohol and cigarettes already: taxes, ads &amp; marketing restrictions, health warning mandated communication.",
      "time": 1770387757,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "croes",
      "id": 46913084,
      "parent": 46912945,
      "text": "&gt; You can&#x27;t legislate intelligence...<p>That’s why we ban harmful things.",
      "time": 1770387387,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "BadBadJellyBean",
      "id": 46912793,
      "kids": [
        46912936
      ],
      "parent": 46912584,
      "text": "Funnily all of Duolingo&#x27;s retention mechanisms (formemost streaks and leagues) have the exact opposite effect on me. I am only moderately encouraged by success and extremely discouraged by failure. That means keeping the streak up is stress for me and failing a streak leads to a big negative impact on my motivation for the failure and a positive reinforcement of not doing it because then the stress goes away and that is nice. They literally train my brain not to use their app.",
      "time": 1770385761,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "SoftTalker",
      "id": 46912745,
      "parent": 46912584,
      "text": "This is pretty much everything in business these days. Medicine too. Nobody is interested in solving your problems for a price. They are interested in selling you a never-ending service or subscription that you pay for over and over.",
      "time": 1770385428,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "thaumasiotes",
      "id": 46912726,
      "parent": 46912584,
      "text": "&gt; and the lesson plans seem designed to plateau to prevent you from actually getting proficient enough in a language to ever unsub<p>They don&#x27;t need to design for that. If you want to become proficient in the language, you&#x27;ll have to use the language for something. Whatever lessons Duolingo provides, they won&#x27;t get you to become proficient in a language.",
      "time": 1770385318,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "criddell",
      "id": 46912544,
      "kids": [
        46913309,
        46913170,
        46913158,
        46912614,
        46913194,
        46912823
      ],
      "parent": 46912077,
      "text": "Is it worse than walking around 8 hours a day listening to music? Having headphones on while washing dishes and walking the dog?<p>I think it is, but it&#x27;s hard for me to articulate without getting into teleological judgments.",
      "time": 1770384346,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "nolroz",
      "id": 46912212,
      "kids": [
        46912418,
        46913110,
        46912425,
        46913211,
        46913275,
        46912405,
        46912775,
        46912312,
        46912479
      ],
      "parent": 46912077,
      "text": "How&#x27;d you kick it?",
      "time": 1770382335,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "api",
      "id": 46912380,
      "parent": 46912077,
      "text": "Short form video content in general is ludicrously addictive. All infinite scroll is addictive but there’s something particularly strong when it’s short videos that each deliver some kind of hook or punch line.<p>I landed on YouTube shorts once and started scrolling. Hours later I genuinely felt like I’d been drugged. It was shocking and surreal how powerful the effect was. Made it a point since then to never go there. I’ve never touched TikTok but I’ve heard stories of people spending every waking second on that thing.<p>Obviously some people are going to be more prone to it than others.",
      "time": 1770383281,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "thinkingtoilet",
      "id": 46913330,
      "parent": 46913297,
      "text": "What&#x27;s your solution to the current problem? Because the free market ain&#x27;t working.",
      "time": 1770388583,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "KaiserPro",
      "id": 46913205,
      "parent": 46912664,
      "text": "I think the chinese version of tiktok has most of these guards on for children",
      "time": 1770387919,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "concats",
      "id": 46913169,
      "parent": 46912664,
      "text": "&gt; Most of these seem concretely doable, and maybe effective. But the core of the addictiveness comes from the &quot;recommender system&quot;, and what are they supposed to do there? Start recommending worse content? How much worse do the recommendations have to be before the EC is satisfied?<p>I agree with you, this is rather odd. And sort of missing the problem.<p>All apps are about attention. The percentage of the time spent using the app when it shows you your good content (Whatever it is that you&#x27;re interested in) determines how addictive it is. And the percentage of time it&#x27;s showing you bad content (Ads, &#x27;screen time breaks&#x27;, manual scroll time, more ads, loading screens, sponsor ads, filler content (youtube for instance is full of this), etc) counteracts the addictive properties because nobody likes it.<p>What&#x27;s the end goal here? Right now TikTok is winning the attention economy race against the other apps because it&#x27;s more focused on the user&#x27;s preferred content. Is that what we want to reduce? To show more uninteresting other stuff on the screen? Like blank &#x27;wait 5 minute&#x27; statics? Or just more ads?<p>I get that we don&#x27;t want a generation of socially inept phone addicts, but this won&#x27;t solve anything I fear. People will still want the good content, forcing the most customer friendly (it feels wrong to say that about TikTok) app to become more enshittified is a bewildering solution.",
      "time": 1770387760,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "walt_grata",
      "id": 46912681,
      "kids": [
        46912857
      ],
      "parent": 46912664,
      "text": "Worse enough it isn&#x27;t addictive. The goal is non-addictive, whatever changes to whatever part are necessary to hit that goal.",
      "time": 1770385087,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "Juliate",
      "id": 46913289,
      "parent": 46913253,
      "text": "&gt; Banning infinite scroll comes close to banning good design.<p>If infinite scroll is good design.<p>&gt; we might as well throw every designer in prison<p>No, we might as well convict every manager&#x2F;boss that assign those goals to the designers.<p>Designers don&#x27;t dream these patterns out of thin air, they have incentives to.",
      "time": 1770388341,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "clydethefrog",
      "id": 46912263,
      "kids": [
        46912473
      ],
      "parent": 46912037,
      "text": "The European Commission bases its investigation on the rules laid down in the Digital Services Act (DSA). This European legislation, introduced in 2022, imposes strict requirements on companies offering digital services in Europe.<p>In addition to TikTok, the social media company Meta, Facebook&#x27;s parent company, is also under the investigation.<p><a href=\"https:&#x2F;&#x2F;ec.europa.eu&#x2F;commission&#x2F;presscorner&#x2F;detail&#x2F;en&#x2F;ip_24_2664\" rel=\"nofollow\">https:&#x2F;&#x2F;ec.europa.eu&#x2F;commission&#x2F;presscorner&#x2F;detail&#x2F;en&#x2F;ip_24_...</a><p>Quoting: \n&gt;The Commission is concerned that the systems of both Facebook and Instagram, including their algorithms, may stimulate behavioural addictions in children, as well as create so-called &#x27;rabbit-hole effects&#x27;. In addition, the Commission is also concerned about age-assurance and verification methods put in place by Meta.<p>And before someone mentions the other?\nX - the everything app formally known as Twitter - is also under the Commission&#x27;s scrutiny. It was fined approximately 120 million euro at the end of last year.",
      "time": 1770382692,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "black_puppydog",
      "id": 46912197,
      "parent": 46912037,
      "text": "it may not be. but it&#x27;s common to fight a legal battle against <i>one</i> perpetrator first, then see for the rest. gotta start somewhere, why not start at what&#x27;s arguably the most toxic and obvious case, even if (or exactly because) it&#x27;s been around for less long.",
      "time": 1770382250,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "Mordisquitos",
      "id": 46912068,
      "kids": [
        46912178,
        46912371,
        46912443
      ],
      "parent": 46912037,
      "text": "Maybe it isn&#x27;t any different to Facebook, I don&#x27;t know. Why would if matter if Facebook isn&#x27;t any different from TikTok in the context of this news?",
      "time": 1770381455,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "embedding-shape",
      "id": 46912238,
      "parent": 46912037,
      "text": "Seems to be the same as Facebook, and a bunch of others, so hopefully they&#x27;re all looking into ways of stop breaking the law, if their lawyers have flagged this preliminary decision to them yet.",
      "time": 1770382529,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "StilesCrisis",
      "id": 46912478,
      "parent": 46912037,
      "text": "Not to mention Instagram. It is almost indistinguishable from TikTok now.",
      "time": 1770383979,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "Aerbil313",
      "id": 46912309,
      "parent": 46912037,
      "text": "It&#x27;s not any different. Facebook, Instagram, Tiktok, Reddit, all are in the same boat. Explicitly designed, tested and benchmarked to hack human reward circuits most effectively to maximize ad revenue.",
      "time": 1770382868,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "KaiserPro",
      "id": 46913339,
      "parent": 46912290,
      "text": "The algorithm is pretty simple, it&#x27;ll show you a selection of videos that are from the n most popular genres of videos, then depending on your dwell time, it&#x27;ll A&#x2F;B test categories that are related, or sub categories.<p>That bit isn&#x27;t that difficult or new. the special sauce is the editorialising and content categorisation. being able to accurately categorise videos into genres, subjects and sub subjects (ie makeup video, 25 year olds, woman, straight, new york, eyeglitter)  and then creating a graph of what persona likes what.<p>The second secret sauce is people going through and finding stuff and promoting it. TikTok (used to) editorialise&#x2F;pay highly for content.",
      "time": 1770388624,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "frantathefranta",
      "id": 46912874,
      "parent": 46912290,
      "text": "I&#x27;m in the same boat. I have a TikTok account so my wife and friends can send me videos (mostly cute dogs). It&#x27;s funny when people probe why I don&#x27;t use TikTok and they think it must be because I&#x27;m against the Chinese&#x2F;Larry Ellison influence or other common reason. No, I just don&#x27;t like the format.",
      "time": 1770386237,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "batrat",
      "id": 46912797,
      "parent": 46912290,
      "text": "I did the same... even faster. I installed it, suggested me some local crap. I wanted ltt, mkbhd, etc. searched those 2, added them, after that first 2 videos were the same crap. uninstall. even youtube is better. It&#x27;s so much content on youtube that It&#x27;s impossible to watch it all in a lifetime even at 5x speed. And 10x better content.",
      "time": 1770385793,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "thechao",
      "id": 46912464,
      "parent": 46912290,
      "text": "It&#x27;s a constant stream of makeup &amp; dogs. I just stick to Michael Penn on YT.",
      "time": 1770383910,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "Aurornis",
      "id": 46912920,
      "parent": 46912784,
      "text": "&gt; I recently browsed the same feed on mobile ... and it was entirely different! I think I spent a half hour and saw zero content from my follows<p>At the top of the mobile app there’s a “For You” tab and a “Following” tab. You must have been on the “For You” tab.<p>Switch to the “Following” tab.<p>If you start scrolling the “For You” tab and do it for half an hour straight, you’re basically signaling that this the content you wanted to see and will continue getting more of it.",
      "time": 1770386511,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "zbentley",
      "id": 46913273,
      "parent": 46913073,
      "text": "This kind of absolutism is unhelpful. At every point on the spectrum between &quot;a good app that people choose to spend time on because it&#x27;s valuable to them&quot; and &quot;heroin marketed to preteens in schools&quot; there is no clear line or delineation between addictive abuse and autonomy.<p>But we still don&#x27;t let liquor stores sell to kids. We still criminalize a lot of drug use. And while there are tons of different opinions about whether <i>specific instances</i> of those restrictions are appropriate, pretty much everyone agrees that there are qualitative differences between predatory behavior-influencing and bad choices.<p>It&#x27;s a question about where to move lines that society already broadly agreed to put in place, not about whether to have lines at all <i>a la</i> &quot;well you might as well just make bad choices illegal then&quot;. We already do that, and it succeeds at mitigating harm in many (not all) cases.",
      "time": 1770388268,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "concats",
      "id": 46913252,
      "parent": 46912548,
      "text": "I think one of the things that short form videos do really well is that they punish creators who pad their videos with unnecessary filler content. On TikTok for example (Not necessarily a fan of the app but it&#x27;s a good example) no videos start with all that empty jabbering you often see on YouTube (&quot;Welcome to my channel...&quot;, &quot;Today we will...&quot;, &quot;Please Like and Subscribe...&quot;, &quot;This video is sponsored by...&quot;, etc), because if they tried any of that crap the viewers would just swipe the content away. So, instead they always get straight to the point. That part is really refreshing.<p>Of course, there are other issues instead.",
      "time": 1770388156,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "SlightlyLeftPad",
      "id": 46912962,
      "parent": 46912548,
      "text": "You likely weren’t wired into it while your brain was developing.<p>There’s clear scientific evidence that these shorts trigger addiction-like behavior[1]. The detrimental effects on a kid’s brain development can be inferred[2]. A reasonable argument could made that it’s not so different from things like nicotine, alcohol or other drugs when it comes to child brain development. I believe these companies know this and willfully push it on kids anyway.<p>Edit: And I think it’s really telling that China has some of the strictest state-led anti-addiction and youth protection policies globally[3].<p>[1]<a href=\"https:&#x2F;&#x2F;www.sciencedirect.com&#x2F;science&#x2F;article&#x2F;pii&#x2F;S1053811921004134\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sciencedirect.com&#x2F;science&#x2F;article&#x2F;pii&#x2F;S105381192...</a><p>[2]<a href=\"https:&#x2F;&#x2F;www.sciencedirect.com&#x2F;science&#x2F;article&#x2F;pii&#x2F;S105381192500031X\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sciencedirect.com&#x2F;science&#x2F;article&#x2F;pii&#x2F;S105381192...</a><p>[3] <a href=\"https:&#x2F;&#x2F;cjil.uchicago.edu&#x2F;print-archive&#x2F;kids-no-phones-dinner-table-analyzing-peoples-republic-chinas-proposed-minor-mode?utm_source=chatgpt.com\" rel=\"nofollow\">https:&#x2F;&#x2F;cjil.uchicago.edu&#x2F;print-archive&#x2F;kids-no-phones-dinne...</a>",
      "time": 1770386778,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "hyperpape",
      "id": 46912496,
      "parent": 46912347,
      "text": "European regulators and courts have placed a lot of scrutiny on big US tech companies, with frequent fines for privacy violations and potential anti-competitive behavior. Also as noted upthread, they&#x27;re investigating Meta and Twitter on this specific issue.",
      "time": 1770384091,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "xienze",
      "id": 46912403,
      "parent": 46912347,
      "text": "You’re getting downvoted but seriously, it took them this long to figure this out? I also suspect they won’t outright ban TikTok, but instead levy a multi-billion dollar fine and let it continue operating.",
      "time": 1770383444,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "meltyness",
      "id": 46913024,
      "parent": 46912457,
      "text": "You can try and squeeze a free speech absolutism story out of it, but the reality is that this has been a story since Microsoft got into cable news.<p>At that point it was a game of &quot;I&#x27;m not slandering you&quot; to chip away at every other valuation, that could have easily have just been called antitrust because they didn&#x27;t build it. That was 1996-2005 and went completely unchecked.<p>This is similar but the stack was even cheaper, and closer to more people&#x27;s faces.<p>Even if governments take no recourse, I don&#x27;t see an issue with government using it&#x27;s position to put a food pyramid in citizen&#x27;s faces to say like, &quot;this can be harmful.&quot; The church probably would have if this were long ago, except, instead of fire and brimstone, some sort of epic story of social isolation, permanent dissatisfaction, and self-imposed constraints, alien abduction, transformation into a pig by a wizard?<p>There&#x27;s probably a lot of visceral fears that would be worthy analogs to the harms of the feed.<p>I don&#x27;t think that this narrative has been explored enough, honestly. Corps keep building crap like this, even amazon has (had?) an influencer feed.<p>People who are in play&#x2F;leisure should probably practice tolerating more choices than &quot;express mild, momentary dissatisfaction and receive an instantaneous reward&quot;... that&#x27;s probably not a life everyone should be trained to live",
      "time": 1770387099,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "spicyusername",
      "id": 46912481,
      "parent": 46912457,
      "text": "Unfortunately, based on the consumption habits of many, many people, yes.",
      "time": 1770383981,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "wackget",
      "id": 46913229,
      "parent": 46912457,
      "text": "Do you consume heroin? If not, why not?<p>Unregulated social media is digital heroin. And allowing it to be run by billionaires with thinly-veiled agendas is like cutting the heroin with rat poison.",
      "time": 1770388047,
      "type": "comment",
      "depth": 1
    },
    {
      "by": "dmix",
      "id": 46913137,
      "kids": [
        46913184,
        46913291,
        46913195
      ],
      "parent": 46913079,
      "text": "People are way too comfortable banning things these days. This is where the term &#x27;nanny state&#x27; comes from. A subset of the population doesn&#x27;t have self control? Ban it everyone. Even if it&#x27;s a wildly popular form of entertainment with millions of creators sharing their lives, who cares we know better.",
      "time": 1770387617,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "travoc",
      "id": 46913162,
      "kids": [
        46913216
      ],
      "parent": 46913079,
      "text": "Your short form comment is in violation of EU Directive 20.29A. Agents have been dispatched to your home to collect your devices.",
      "time": 1770387740,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "candiddevmike",
      "id": 46913185,
      "parent": 46913079,
      "text": "Any good research papers on the impact of short form video on the human brain?  This is a major cause for the attention crisis we&#x27;re facing IMO.",
      "time": 1770387811,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "hutattedonmyarm",
      "id": 46912936,
      "parent": 46912793,
      "text": "This is precisely why I stopped using it",
      "time": 1770386586,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "jcynix",
      "id": 46913309,
      "parent": 46912544,
      "text": "When it&#x27;s a streaming service, it might be equally worse IMO, but a bit less so if it&#x27;s music you own. But anyways, I call these folks &quot;electro autists&quot; (with apologies to real autists) as they are rarely  reachable for social interactions. Saying &quot;good morning&quot; in the elevator? No chance. Nor recognizing people left or right.<p>Or in the gym, where they block machines for many minutes, i.e. much more than the one or two minutes of resting in between sets, while paging through social media in between sets. Asking them to unblock a machine in the gym? Some are reachable there if you stand in front of them and wave your hands.<p>And walking the dog, or strolling with kids while on &quot;social&quot; media. I often observe them to neither recognize when either dog or kid try to show them things or events. I sometimes wonder (aloud and near them ;-), if they phone with their companions.<p>Oldie but Goldie: Charlene Guzman&#x27;s video &quot;I forgot my phone&quot; from 22 years ago:<p><a href=\"https:&#x2F;&#x2F;youtube.com&#x2F;watch?v=OINa46HeWg8\" rel=\"nofollow\">https:&#x2F;&#x2F;youtube.com&#x2F;watch?v=OINa46HeWg8</a><p>I like music and I like videos, but I also learned to  concentrate on the task at hand and&#x2F;or the people besides me.<p>Disclaimer: listening to music while doing chores like washing dishes is OK. But I prefer a dish washer and connect to people while the dish washer is running.",
      "time": 1770388448,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "gh0stcat",
      "id": 46913170,
      "parent": 46912544,
      "text": "I would say it&#x27;s slightly worse but they&#x27;re both not great, as someone who was addicted to being fed <i>something</i> at all times, I was really avoiding every having to spend time with myself if that makes sense. That being said, it&#x27;s mostly about intention. Are you excited to finally listen to that amazing album or audiobook on your walk after work? That&#x27;s usually more healthy than when I would scroll on tiktok during my day to avoid feeling anything other than dopamine and avoid bad feelings. It&#x27;s really about self awareness for me.",
      "time": 1770387762,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "r_lee",
      "id": 46913158,
      "parent": 46912544,
      "text": "I have headphones on 24&#x2F;7 and while outside, but if I didn&#x27;t have them I wouldn&#x27;t exactly mind, I&#x27;d probably widh I wouldn&#x27;t have to hear the loud noises (cars, bus engine sound etc)<p>I feel like with Tikatok etc. its really just that your entire attention both audio and visual is stuck in that thing, it&#x27;s not an auxiliary activity",
      "time": 1770387735,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "kyriakos",
      "id": 46912614,
      "parent": 46912544,
      "text": "Not sure if its worse but you are point rings a bell for me cause I feel that I can no longer do any task without having something being bombarded in my head, be it podcast, music or audiobook.",
      "time": 1770384744,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "KaiserPro",
      "id": 46913194,
      "parent": 46912544,
      "text": "&gt; Is it worse than walking around 8 hours a day listening to music? Having headphones on while washing dishes and walking the dog?<p>If you think about cognitive load, then I would say yes.<p>Listening to music or even talking with headphones does consume some of your brain power, but you are able to execute physical tasks reasonably well. For example I am able to do DIY (apart from measuring) whilst listening to audiobooks. I can do all the household chores too (washing up, clothes, tidying vaccuming etc)<p>I cannot do that with short videos playing. firstly I have to hold the device, secondly I&#x27;m not looking at what I am doing, thirdly, moving pictures attract my attention.<p>In the same way that that most people are utterly unable to do &quot;thinking work&quot; (ie stuff that requires inner monologue and visualisation [sorry aphantasia people]) with a TV within visual range. I know that some people are able to do ironing infront of the TV, but I&#x27;d struggle with that to do a good job",
      "time": 1770387873,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "mrkickling",
      "id": 46912823,
      "parent": 46912544,
      "text": "Similar, but at least headphones uses fewer of your senses",
      "time": 1770385946,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "jumpman500",
      "id": 46912418,
      "parent": 46912212,
      "text": "I wasn’t able to stomach the idea of Larry Ellison being able to silently nudge my political views so I just deleted the app. Without the allure of China being able to influence my opinion I lost interest.",
      "time": 1770383597,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "mtoner23",
      "id": 46913110,
      "parent": 46912212,
      "text": "The android app scrollguard helped me. Stops YouTube short, reels and TikTok from being clicked on. It has massive permissions to survey my phone which could be scary. But as an addict you have to admit when you need to check yourself into rehab. And the phone is the drug.",
      "time": 1770387494,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "iepathos",
      "id": 46912425,
      "parent": 46912212,
      "text": "Get a life that&#x27;s more interesting than dish washing 4-8 hours a day.",
      "time": 1770383645,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "gh0stcat",
      "id": 46913211,
      "parent": 46912212,
      "text": "It&#x27;s bad I can&#x27;t say that I did it with willpower alone but Brick helped immensely. Their product is great, not a subscription, and even though there are competitors or you could build something like this for your phone, they&#x27;re good with customer service and I would recommend their product.<p>Also, Unhook for removing suggestions&#x2F;comments&#x2F;etc from Youtube, you can basically turn everything off until it becomes a search bar and your subscriptions.<p>Get a good website blocking browser extension.\nRemove anything that resembles a &quot;recommendation&quot; or avoid it like the plague.<p><a href=\"https:&#x2F;&#x2F;getbrick.app&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;getbrick.app&#x2F;</a>",
      "time": 1770387934,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "PlatoIsADisease",
      "id": 46913275,
      "parent": 46912212,
      "text": "Not OP, but my favorite book of all time is Power of Habit by Charles Duhigg. I quit every drug, stopped playing video games, quit social media for 3 years, started exercising daily.<p>I&#x27;m only back on social media because it actually made my life worse being off it.",
      "time": 1770388278,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "c-fe",
      "id": 46912405,
      "kids": [
        46912633
      ],
      "parent": 46912212,
      "text": "uninstall the app. Works really well to me. The conscious effort of reinstalling it is enough to prevent me from doing it. Whereas using the awfully implemented screentime guards, I just find myself clicking on &quot;Allow for 15 minutes&quot; before I even understand what I do.",
      "time": 1770383457,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "mosquitobiten",
      "id": 46912775,
      "parent": 46912212,
      "text": "I deleted the account, made a new one from a different location at a later date and then scrolled for a few minutes and realised I would need multiple hours of scrolling through absolute shit content I genuinely despise to train the ai back to what it was. And I gave up on that and deleted the app forever.",
      "time": 1770385639,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "bilsbie",
      "id": 46912312,
      "kids": [
        46912456
      ],
      "parent": 46912212,
      "text": "For me it’s kicking itself lately. The content has gotten way less interesting over the past few months.<p>Maybe it just has to run its course.",
      "time": 1770382881,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "fragmede",
      "id": 46912479,
      "parent": 46912212,
      "text": "In the depths of it, it&#x27;s the last thing before I fell asleep, and the first thing I did in the morning, so the first thing was to break that cycle. Forced myself to have an independent thought for myself in the morning <i>before</i> I checked TikTok&#x2F;Reels&#x2F;YouTube shorts&#x2F;Reddit&#x2F;Hacker News. Then, not bringing my phone to bed at night, then just <a href=\"https:&#x2F;&#x2F;xkcd.com&#x2F;386&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;xkcd.com&#x2F;386&#x2F;</a> letting people be wrong on the Internet. Unless it affects my offline life in some way, it&#x27;s just not as big a deal anymore.",
      "time": 1770383979,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "Retr0id",
      "id": 46912857,
      "parent": 46912681,
      "text": "&quot;non-addictive&quot; isn&#x27;t a well-defined thing. It&#x27;s like telling McDonalds that their food must be &quot;healthy&quot;. There&#x27;s a lot of regulation affecting the food that McDonalds serves (and that&#x27;s probably a good thing), but it&#x27;s all based on measurable things.",
      "time": 1770386109,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "input_sh",
      "id": 46912473,
      "parent": 46912263,
      "text": "To explain it in a little bit better: Digital Services Act designates websites as Very Large Online Platforms (VLOPs) based on the number of monthly active users within the EU (&gt;45 million, roughly 10% of all EU citizens).<p>Once the website is designated as such, you&#x27;re looked at with more scrutiny, have to comply to higher standards, and the exact remediation steps are decided on a case-by-case basis. All of the cases are chugging along, but not all of them are on the same stage.<p>If your website is <i>not</i> popular enough to be designated as VLOP, this law basically doesn&#x27;t exist. It&#x27;s not like GDPR in a sense that it defines some things <i>everyone</i> has to follow, regardless of your audience size.",
      "time": 1770383940,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "paulryanrogers",
      "id": 46912178,
      "kids": [
        46912195,
        46912316
      ],
      "parent": 46912068,
      "text": "Maybe because FB are getting away with the same thing?",
      "time": 1770382138,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "hagbard_c",
      "id": 46912371,
      "parent": 46912068,
      "text": "It matters because everyone - people, companies, countries - is supposed to be equal in front of the law. Selective application of the law shows this not to be the case and shows that there are other factors in play which decide whether someone - a person, a company, a country - gets to violate some law without legal consequences while someone else is prosecuted for the same violation.<p>If you now think &quot;they have to start <i>somewhere</i> in prosecuting these violations&quot; you&#x27;re partly correct but also partly mistaken. Sure they have to start somewhere but they could - and if they are really serious about their claims <i>should</i> - have started prosecuting all those other companies which did this way before TikTok or even its predecessor Musically was a thing. Algorithm-driven endless scroll designs to keep user&#x27;s eyes glued to the screen have been a thing from very early on in nearly all &#x27;social&#x27; app-site-things and the warning signs about addictive behaviour in users have been out for many years without the law being thrown at the proprietors of those entities. As to why this has not happened I&#x27;ll leave for the reader to decide. There are plenty of other examples to be found in this regard ranging from the apprehension of the Telegram CEO to the sudden fervour in going after X-formerly-known-as-Twitter which seem to point at politics being at play in deciding whether a company gets to violate laws without being prosecuted or not.<p>So what&#x27;s the solution you ask? As far as I can see it is to keep these companies from violating user&#x27;s rights by keeping them in line regardless of who owns or runs the company and regardless of whether those owners or proprietors are cooperative on other fronts. Assuming that these laws were written to stem the negative influence these app-things have on their users they should have gone after many other companies much earlier. Had they done so it might even have led to TikTok realising that their scheme would not work in the EU. They might not have launched here or they might have detuned their algorithmic user trap, they might have done many things to negate the negative effects of their product. They might just have decided to skip the whole EU market altogether like many other companies have done and do. I&#x27;d have thought &#x27;good riddance&#x27;, what you?",
      "time": 1770383229,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "iepathos",
      "id": 46912443,
      "kids": [
        46912465
      ],
      "parent": 46912068,
      "text": "Apparent hypocrisy and injustice in government policy is an ugly thing in the world that should be pointed out and eliminated through public awareness and scrutiny.",
      "time": 1770383758,
      "type": "comment",
      "depth": 2
    },
    {
      "by": "halestock",
      "id": 46913184,
      "parent": 46913137,
      "text": "&gt; A subset of the population doesn&#x27;t have self control? Ban it everyone. Even if it&#x27;s a wildly popular form of entertainment<p>Like gambling?",
      "time": 1770387811,
      "type": "comment",
      "depth": 3
    },
    {
      "by": "micromacrofoot",
      "id": 46913291,
      "parent": 46913137,
      "text": "how do you feel about self control in the face large companies that are spending billions of dollars to intentionally trick you into not having it?<p>you can&#x27;t even be aware of <i>what</i> they&#x27;re doing, because the algorithms they&#x27;re using to do it are black boxes<p>youtube algorithms have shown evidence that they&#x27;ve lead to radicalization<p>would you not draw a line on any of this?",
      "time": 1770388353,
      "type": "comment",
      "depth": 3
    },
    {
      "by": "Juliate",
      "id": 46913195,
      "parent": 46913137,
      "text": "When most of the market using it is abusive, and a source of abuse, preventing the abuse to continue while it&#x27;s being investigated, or better apprehended by the population&#x2F;generations at large, makes sense.",
      "time": 1770387874,
      "type": "comment",
      "depth": 3
    },
    {
      "by": "embedding-shape",
      "id": 46913216,
      "parent": 46913162,
      "text": "One way is criminalizing the victims, another is going after the platforms. I&#x27;m willing to wager a bet on who will be the ones receiving the enforcements here :)",
      "time": 1770387975,
      "type": "comment",
      "depth": 3
    },
    {
      "by": "sidrag22",
      "id": 46912633,
      "kids": [
        46913214
      ],
      "parent": 46912405,
      "text": "I think im just less prone to doomscroll type addictions, but i found myself sitting on the toilet for longer than normal when youtube shorts became something tougher to easily remove from the base youtube experience on their app.<p>This caused me to disable the youtube app(literally can&#x27;t uninstall it on a pixel stock os), and if i ever utilize youtube on my phone its through firefox instead.<p>I also got the extension unhook on my desktop&#x2F;laptop, and now my youtube experience is more reminiscent of the early 2010s where I would just use it to look up sports highlights or music videos, and if i don&#x27;t have a video or subject in mind im not force fed one.<p>This also just kinda shows me how terrible the search experience is on youtube. Feel like all of their effort is on their doomscroll &#x2F; suggested content, rather than their search results.",
      "time": 1770384854,
      "type": "comment",
      "depth": 3
    },
    {
      "by": "pjc50",
      "id": 46912456,
      "kids": [
        46912571
      ],
      "parent": 46912312,
      "text": "Are you in the US? Lots of people have reported that the forced sale &quot;ruined&quot; their algorithm.",
      "time": 1770383854,
      "type": "comment",
      "depth": 3
    },
    {
      "by": "fifilura",
      "id": 46912195,
      "kids": [
        46912295,
        46912601
      ],
      "parent": 46912178,
      "text": "I doubt they would if this becomes illegal.<p>EU laws are slow, sometimes stupid, but consistent.",
      "time": 1770382233,
      "type": "comment",
      "depth": 3
    },
    {
      "by": "hnbad",
      "id": 46912316,
      "parent": 46912178,
      "text": "Let me rephrase your question: &quot;But if it&#x27;s illegal for TikTok to do this, shouldn&#x27;t Meta also be sued over it?&quot;<p>The answer is &quot;Yes&quot;.",
      "time": 1770382895,
      "type": "comment",
      "depth": 3
    }
  ]
}